[
    {
        "title": "ekmwest",
        "url": "/index.html",
        "content": "ekmwest The Communist Mistake APR 29, 2021 The Parenting Paradox DEC 13, 2020"
    },
    {
        "title": "The Communist Mistake",
        "url": "/the-communist-mistake.html",
        "content": "ekmwest APRIL 29, 2021 The Communist Mistake The Communist Mistake is to assume that facts can be known. Planned economy is an instructive example. No person or organization can predict the complex interactions between capital, resources, labor, intellectual property, and distribution. Planned economy is a mistake because it assumes that facts about the future can be known. A market economy isn&#39;t planned. It&#39;s not based on facts. Technological advancements, and changes in consusumer demands, are met by opportunistic companies. Of course, every company has a plan. Every company must act on assumptions about facts. But the market doesn&#39;t. A market economy doesn&#39;t assume that facts can be known. And that&#39;s why it works. In some situations, fact can be known. The sun will rise tomorrow and you&#39;re reading this post right now. But be aware. Looks can be decieving. Newton&#39;s law of gravity describes a simple relationship between bodies. But a system with just more than two bodies is impossible to predict analytically. What looks simple might not be so. There&#39;s no reason to expect that the universe should behave in an analytically predictable manner. Expect the opposite. Assume that no plan survives contact with the enemy. Assume that fact can&#39;t be known. Don&#39;t make the communist mistake."
    },
    {
        "title": "The Parenting Paradox",
        "url": "/the-parenting-paradox.html",
        "content": "ekmwest DECECMBER 13, 2020 The Parenting Paradox The purpose of parenting is teaching children how to become successful. Paradoxically, success cannot be taught. By their own estimate, most parents aren&#39;t successful. Successful parents don&#39;t truly understand what made them successful. Whatever made them successful is not relevant today. Whatever made them successful is not relevant to their children. Their children have a different definition of success. Their children don&#39;t want to be taught. This paradox is not limited to parenting. It applies to advicing and counseling in general."
    }
]