[
    {
        "title": "ekmwest",
        "url": "/index.html",
        "content": "ekmwest The Closed-Minded Principle SEP 10, 2021 The Communist Mistake APR 29, 2021 The Parenting Paradox DEC 13, 2020"
    },
    {
        "title": "Perspective Switching Toolbox",
        "url": "/perspective-switching-toolbox.html",
        "content": "ekmwest JUN 25, 2021 Perspective Switching Toolbox The most interesting aspects of life are complex. And for complex situations, there&#39;s no simple right or wrong. In business, relationships, and politics, there&#39;s no black or white. Finding new perspectives are... In order to better understand life, business, or relationships, we need to find new perspectives... Here are some of the tools I use to find new perspectives. (1) The Evolutionary Explanation Some opinions and behaviors are inexplicable. They don&#39;t make sense. (2) Question the Assumptions Every problem is based assumptions, but they&#39;re very hard to detect. (3) The Progress Assumption ... (4) It&#39;s You ... (5) The Object is The Subject We live our lives as subjects and every other human being is a kind of object in our perception of reality. (6) Emphaty ... (7) Build it ..."
    },
    {
        "title": "The Closed-Minded Principle",
        "url": "/the-closed-minded-principle.html",
        "content": "ekmwest SEP 10, 2021 The Closed-Minded Principle If A regards B as closed-minded, it follows that B regards A as closed-minded."
    },
    {
        "title": "The Communist Mistake",
        "url": "/the-communist-mistake.html",
        "content": "ekmwest APRIL 29, 2021 The Communist Mistake The Communist Mistake is to assume that facts can be known. Planned economy is a clarifying example. No person or organization can predict the complex interactions between capital, resources, labor, intellectual property, and distribution. Planned economy is a mistake because it assumes that facts about the future can be known. A market economy isn&#39;t planned. It&#39;s not based on facts. Technological advancements, and changes in consusumer demands, are met by opportunistic companies. Each individual company has a plan of course. But the market itself doesn&#39;t. Obviously, facts can be known in some situations. The sun will rise tomorrow and you&#39;re reading this post right now. But be aware — looks can be decieving. Newton&#39;s law of gravity describes a simple relationship between bodies. But a system with more than two bodies is impossible to analytically predict. What looks simple might not be so. There&#39;s no reason to expect that the universe should behave in an analytically predictable manner. Expect the opposite. Assume that no plan survives contact with the enemy. Assume that fact can&#39;t be known. Don&#39;t make the Communist Mistake."
    },
    {
        "title": "The Parenting Paradox",
        "url": "/the-parenting-paradox.html",
        "content": "ekmwest DECECMBER 13, 2020 The Parenting Paradox The purpose of parenting is teaching children how to become successful. Paradoxically, success cannot be taught. By their own estimate, most parents aren&#39;t successful. Successful parents don&#39;t truly understand what made them successful. Whatever made them successful is not relevant today. Whatever made them successful is not relevant to their children. Their children have a different definition of success. Their children don&#39;t want to be taught. The Parenting Paradox is not limited to parenting. It applies to advicing and counseling in general."
    }
]