[
    {
        "title": "Anti-Intuition",
        "description": "",
        "url": "/anti-intuition.html",
        "content": "October 1, 2022 Anti-Intuition If you work in a complex environment like business, product design, or finance, you shouldn&#39;t trust your intuition. Intuition is an efficient unconsious pattern reconition mechanism. Your intuition can be correct or wrong, but it feels the exact same way in both situations. You feel confident that you&#39;re correct. You can improve your intuition by not trusting it. Study complex and surprising fields to improve your anti-intuition. Study linguistics rather than grammar. Study ecosystems rather than genetics. When you study linguistics and ecosystems enough, you will learn that your assumptions and intuitions are frequently wrong. Try to improve this spontanous reaction. When you feel like you know something, you should immediately become suspicious. This is anti-intuition."
    },
    {
        "title": "Identity Instrumentalization",
        "description": "",
        "url": "/identity-instrumentalization.html",
        "content": "December 20, 2021 Identity Instrumentalization Identity is valuable only as a goal. As something to aspire to become. Once achieved, and recognized by professional peers, identity becomes shackles. But once you&#39;ve reach a certain level, once you&#39;ve become what you want to become, your identity will confine you. You must shred your identity and transform it to an instrument. Once you&#39;ve become a leader, you must begin thinking of leadership as an instrument to serve others. You have to run to stand still."
    },
    {
        "title": "ekmwest",
        "description": "",
        "url": "/index.html",
        "content": "The Control Paradox OCT 23, 2022 The Inverse Perception Equality DEC 1, 2021 The Closed-Minded Symmetry SEP 10, 2021 The Communist Mistake APR 29, 2021 The Parenting Problem DEC 13, 2020"
    },
    {
        "title": "The Closed-Minded Symmetry",
        "description": "",
        "url": "/the-closed-minded-symmetry.html",
        "content": "September 10, 2021 The Closed-Minded Symmetry If A regards B as closed-minded, it&#39;s typically true that B regards A as closed-minded."
    },
    {
        "title": "The Communist Mistake",
        "description": "",
        "url": "/the-communist-mistake.html",
        "content": "April 29, 2021 The Communist Mistake The Communist Mistake is to assume that facts can be known. Planned economy is a clarifying example. No person or organization can predict the complex interactions between capital, resources, labor, intellectual property, and distribution. Planned economy is a mistake because it assumes that facts about the future can be known. A market economy isn&#39;t planned. It&#39;s not based on facts. Technological advancements, and changes in consusumer demands, are met by opportunistic companies. Each individual company has a plan of course. But the market itself doesn&#39;t. Clearly, in many situations, facts can be known. The sun will rise tomorrow and you&#39;re reading this paragraph right now. But be aware — looks can be decieving. Newton&#39;s law of gravity describes a simple relationship between moving bodies, but a system with more than just two bodies is impossible to analytically predict. What looks simple might not be so. There&#39;s no reason to expect that the universe should behave in an analytically predictable manner. You should expect the opposite. Assume that no plan survives contact with the enemy. Assume that facts can&#39;t be known. Don&#39;t make the Communist Mistake."
    },
    {
        "title": "The Control Paradox",
        "description": "",
        "url": "/the-control-paradox.html",
        "content": "October 23, 2022 The Control Paradox If you wish to control something, you need to understand it. But in order to understand something, you must let go of your wish to control it."
    },
    {
        "title": "The Inverse Perception Equality",
        "description": "",
        "url": "/the-inverse-perception-equality.html",
        "content": "December 1, 2021 The Inverse Perception Equality It looks like the sun is orbiting earth. Or does it? What would it have looked like if it was the other way around? What would it have looked like if earth was spinning around the sun? Does it look like that other train is moving — or does it look like it&#39;s your train that&#39;s moving? What exactly is your perception telling you? Your friend might seem closed-minded when dismissing a book you want to discuss. But what if the book is crap? Are you dismissing your friend&#39;s dismissal? Telling others to &quot;wake up&quot; doesn&#39;t mean you&#39;re not sleeping. Ask yourself, if the inverse of your preception was true, what would it have looked like?"
    },
    {
        "title": "The Parenting Problem",
        "description": "",
        "url": "/the-parenting-problem.html",
        "content": "December 13, 2020 The Parenting Problem The purpose of parenting is teaching children how to become successful. The problem is, success cannot be taught: By their own estimate, most parents aren&#39;t successful. Successful parents don&#39;t really understand what made them successful. Whatever made them successful is not relevant today. Whatever made them successful is not relevant to their children. Their children have a different definition of success. Their children don&#39;t want to be taught. The Parenting Problem is not limited to parenting. It applies to mentoring and teaching in general."
    },
    {
        "title": "The Status Trap",
        "description": "",
        "url": "/the-status-trap.html",
        "content": "January 1, 2022 The Status Trap As you develop your expertise, you&#39;ll successfully think and operate on a higher level. This is natural, but there&#39;s a risk. If you move too fast, you can get lost."
    }
]