[
    {
        "title": "Anti-Intuition",
        "description": "",
        "url": "/drafts/anti-intuition.html",
        "content": "XX, 2023 Anti-Intuition If you work in a complex environment like business, product design, or finance, you shouldn&#39;t trust your intuition. Intuition is an efficient unconsious pattern reconition mechanism. Your intuition can be correct or wrong, but it feels the exact same way in both situations. You feel confident that you&#39;re correct. You can improve your intuition by not trusting it. Study complex and surprising fields to improve your anti-intuition. Study linguistics rather than grammar. Study ecosystems rather than genetics. When you study linguistics and ecosystems enough, you will learn that your assumptions and intuitions are frequently wrong. Try to improve this spontanous reaction. When you feel like you know something, you should immediately become suspicious. This is anti-intuition."
    },
    {
        "title": "Identity Instrumentalization",
        "description": "",
        "url": "/drafts/identity-instrumentalization.html",
        "content": "XX, 2023 Identity Instrumentalization Identity is valuable only as a goal. As something to aspire to become. Once achieved, and recognized by professional peers, identity becomes shackles. But once you&#39;ve reach a certain level, once you&#39;ve become what you want to become, your identity will confine you. You must shred your identity and transform it to an instrument. Once you&#39;ve become a leader, you must begin thinking of leadership as an instrument to serve others. You have to run to stand still."
    },
    {
        "title": "ekmwest",
        "description": "",
        "url": "/drafts/index.html",
        "content": "Drafts Anti-Intuition XX, 2023 Identity Instrumentalization XX, 2023 The Status Trap XX, 2023"
    },
    {
        "title": "The Status Trap",
        "description": "",
        "url": "/drafts/the-status-trap.html",
        "content": "XX, 2023 The Status Trap As you develop your expertise, you&#39;ll successfully think and operate on a higher level. This is natural, but there&#39;s a risk. If you move too fast, you can get lost."
    },
    {
        "title": "ekmwest",
        "description": "",
        "url": "/index.html",
        "content": "MAR 31, 2023 When The Moment Comes JAN 13, 2023 Ergodicity DEC 31, 2022 Short Thoughts 2022 OCT 23, 2022 The Control Paradox DEC 31, 2021 Short Thoughts 2021 DEC 1, 2021 The Inverse Perception Equality SEP 10, 2021 The Closed-Minded Symmetry APR 29, 2021 The Communist Mistake DEC 31, 2020 Short Thoughts 2020 DEC 13, 2020 The Parenting Problem DEC 31, 2019 Short Thoughts 2019"
    },
    {
        "title": "Ergodicity",
        "description": "",
        "url": "/posts/ergodicity.html",
        "content": "Jan 13, 2023 Ergodicity /* ===================================================================== Constants ===================================================================== */ const INITIAL_WEALTH = 1; const PROBABILITY_OF_WIN = 0.5; const PROBABILITY_OF_LOSS = 1 - PROBABILITY_OF_WIN; const WEALTH_CHANGE_ON_WIN = 1.5; const WEALTH_CHANGE_ON_LOSS = 0.6; const ENSEMBLE_SIMULATION_ROUNDS = 10; const ENSEMBLE_SIMULATION_POPULATION = 10000; const TIME_SIMULATION_ROUNDS = 10000; const KELLY_BET = PROBABILITY_OF_WIN / (1 - WEALTH_CHANGE_ON_LOSS) - PROBABILITY_OF_LOSS / (WEALTH_CHANGE_ON_WIN - 1); /* ===================================================================== Simulations ===================================================================== */ function ensembleSimulation() { // 1. Run Ensemble Simulations const ensembleSimulations = []; for (let i = 0; i { switch (event.target.name) { case 'btnEnsebleSimulation': renderEnsembleSimulation(); break; case 'btnTimeSimulation': renderTimeSimulation(); break; case 'btnKellySimulation': renderKellySimulation(); break; } }); /* ===================================================================== Load Chart Library ===================================================================== */ google.charts.load('current', { 'packages': ['corechart'] }); .math { display: inline-block; font-family: monospace; font-size: .9em; padding: 8px 12px; margin-top: 10px; background-color: var(--bg-color-muted); font-weight: 600; border-radius: 4px; border: 1px solid rgba(0, 0, 0, .2); } .graph { margin: 1em auto .8em; padding: 0 0 10px; border-radius: 2px; background-color: var(--bg-color-muted); } .reload-button { background-color: var(--lightning-blue); color: #fff; border: none; padding: 8px 14px; display: flex; justify-content: center; gap: .6em; margin: 0 auto; cursor: pointer; border-radius: 2em; font: inherit; font-size: .8em; transition: background-color .08s; } .reload-button:hover { background-color: var(--lightning-blue); } .reload-button:active { background-color: var(--lightning-blue); } .reload-button svg { height: 1.3em; pointer-events: none; } .reload-button span { pointer-events: none; line-height: 1.3; font-weight: 600; } .reload-button + p { margin-top: 1.8em; } I don't fully comprehend ergodicity or its significance. But the concept is sufficiently counter-intuitive to make it interesting to me. In this article I'll try to explain ergodicity, as far as I understand it, based on a simple game: You have some amount of wealth. A fair coin is tossed. On heads, your wealth increases 50%. On tails, your wealth decreases 40%. Before reading any further, ask yourself — would it be rational to participate in the game..? Ensemble Average — 5% Gain First, let's see what happens on average when multiple players (an ensemble) participate in the game. The average player should gain 5% wealth on each round (on each coin toss):EA = (1.5 + 0.6) / 2 = 1.05 Just to verify this formula, let's simulate an average player. Here we use 10,000 players (the ensemble) and run the game for 10 rounds. The vertical axis shows average wealth on a log scale: Run New Simulation Time Average — 5% Loss Now, let's take the perspective of an individual player. An individual player should, on average, loose 5% wealth on each round:TA = (1.5 * 0.6) / 2 = 0.95 To verify this formula, let's simulatate an individual player. Here we use one single player and run the game 10,000 rounds. The vertical axis shows wealth on a log scale: Run New Simulation Defining Ergodicity Ergodicity have slightly different meanings in different contexts, but here's a commonly used defintion for our case:A process is ergodic if EA = TA Based on this definition, we can conclude that our game is non-ergodic — the ensemble average is not equal to the time average. The ensemble average is 5% gain, and the time average is 5% loss. What I find counter-intuitive is that it's sometimes rational for a group (an ensemble) to participate in a game, but, at the same time, irrational for an individual. How can this be? How can wealth increase for an average player and decrease for an individual player at the same time? I understand the math, but my intuition find it paradoxical. The Significance of Ergodicity Most economic theories are implicitly based on the assumption that processes are ergodic. Economic decisions are considered rational if the expected utility is positive (and irrational otherwise). The expected utility is, by definition, the same as the ensemble average, but as we've seen, the ensemble average might be very different from the time average. When a process is non-ergodic, we can't use expected utility as a definition of economic rationality. In these cases, economic theories are wrong. So the question becomes: Are economic processes typically ergodic? If not, our economic theories might be fundamentally inaccurate. I don't know the answer, but investor Tylor Pearson argues that \"pretty much every human system is non-ergodic\". And advertisement executive Rory Sutherland suggests that risk-aversion-bias might not even exist (at least not to the extent that we've traditionally assumed), because decisions are almost always made in non-ergodic circumstances, and therefore, risk-avoidance must be considered rational, rather than a psychological bias. Whatever the case, I recommend watching this talk by Ole Peters, where he explains the concept of ergodicity and its potential consequences for economic science. The Kelly Fraction To end this article, let's switch gears and have a look at the \"Kelly Fraction\". The Kelly Fraction is used in finance and investment. It's somewhat abstract and difficult to understand, but based on our understanding of ergodicity, I believe we can reach a simple description. Let's slightly modify the game so that a player can choose the amount to bet in each round. In this new scenario, it's in fact possible for an individual player to \"get access\" to some of the ensemble gains. The optimal amount to bet is calculated by the Kelly Fraction:KF = P/A - Q/B P = Probabilty of winA = Fraction lost on lossQ = Probability of lossB = Fraction gained on win For our game, the Kelly Fraction is:KF = 0.5/0.4 - 0.5/0.5 = 0.25 To verify this formula, let's run the time average simulation again, but this time using the Kelly Fraction. Here we use a single player making a 25% bet in 10,000 rounds. The vertical axis shows wealth on log scale: Run New Simulation It's clearly valuable to understand the Kelly Fraction when making investments in non-ergodic environments."
    },
    {
        "title": "",
        "description": "",
        "url": "/posts/index.html",
        "content": ""
    },
    {
        "title": "Short Thoughts 2019",
        "description": "",
        "url": "/posts/short-thoughts-2019.html",
        "content": "Dec 31, 2019 Short Thoughts 2019 No fact has ever been expressed without a motive. Don&#39;t say sorry I&#39;m late. Say thank you for waiting. First-principles thinking is useless in complex environments. Does your value come from you being right? Don&#39;t remember to say thank you. Remember to be greateful. You can&#39;t wake someone who&#39;s pretending to be asleep. Creativity comes from friction, limitations, and troubles. What would you create if there were no needs or problems? Telling others to wake up doesn&#39;t mean you&#39;re not sleeping. Keep the promises you make to yourself. If I don&#39;t know you, how could I give you advice? Ignore time. Appreciate moments."
    },
    {
        "title": "Short Thoughts 2020",
        "description": "",
        "url": "/posts/short-thoughts-2020.html",
        "content": "Dec 31, 2020 Short Thoughts 2020 Stone and chisel makes sharp letters. When curiosity is key, expertise is a barrier. Is this label useful? Is that abstraction relevant? How can you tell? Seek people with different perspectives. Avoid people with different motives. Trial-and-error requires speed. If the process is slow, you need intelligence. What should you discuss with your customers? Solutions or problems? When you say &quot;we&quot;, do you really know if you&#39;re trying to include or exclude? It is easier to graduate from junior to senior, than to graduate from senior to master. Vanity is a much bigger hurdle than ignorance. Good designers love design. Great designers love users. Light requires darkness. The midwit, looking down at the edges, sees no difference between masters and idiots. You only respect what you pay for."
    },
    {
        "title": "Short Thoughts 2021",
        "description": "",
        "url": "/posts/short-thoughts-2021.html",
        "content": "Dec 31, 2021 Short Thoughts 2021 Good intuitions feels exactly like bad intuitions. A mission driven enterprise must be opt-in. A mind that&#39;s externally motivated, can never innovate at the highest level. Work on context and framing. Trust that solutions will emerge. Don&#39;t try to discover new things. Try to discover new ways to discover new things. A system is complex (or not), in and of itself. But a system can also be judged from an epistemic perspective: If you don&#39;t know anything about a system, it might appear complex, even though it isn&#39;t. Make sure to understand the difference. A solution is a piece that can only be found by exploring the puzzle. Being uncertain is a powerful skill. Don&#39;t announce the answer. Show the path to the place where you found the question. Confidence don&#39;t cause skill. Skill cause confidence. Surprisingly, this is rarely understood. Pessimism undermines trust in established models, and creates markets for new opinions, theories, and cults. When you compete, you&#39;re playing by someone else&#39;s rules."
    },
    {
        "title": "Short Thoughts 2022",
        "description": "",
        "url": "/posts/short-thoughts-2022.html",
        "content": "Dec 31, 2022 Short Thoughts 2022 Facts can conceal truth. Opinions are theories clouded by politics. Originality is good for branding, but harmful for usability. Do you really know if you&#39;re encouraging confirmity or creativity? You don&#39;t understand what you see. You see what you understand. Prototype to learn. Don&#39;t try to figure it out. Try to figure out how to figure it out. It&#39;s not about how much you know, it&#39;s about how fast you learn. Compete with kids instead of experts. Everything is good in some contexts, and bad in others. The first question must always be: What&#39;s the right question? There are two kind of designers — those that care about users, and those that believe they care about users. If you&#39;re certain that you&#39;re of the first kind, you&#39;re probably not. Always gather more perspectives. Kindness is partly a decision, but primarily a skill. This is profoundly counterintuitive and rarely understood. Don&#39;t try to understand reality. Instead, try to understand how your perspective shapes the way you understand reality. The master walks his own path. If you want to follow the master, don&#39;t follow the master."
    },
    {
        "title": "The Closed-Minded Symmetry",
        "description": "",
        "url": "/posts/the-closed-minded-symmetry.html",
        "content": "Sep 10, 2021 The Closed-Minded Symmetry If A regards B as closed-minded, it&#39;s typically true that B regards A as closed-minded."
    },
    {
        "title": "The Communist Mistake",
        "description": "",
        "url": "/posts/the-communist-mistake.html",
        "content": "Apr 29, 2021 The Communist Mistake The Communist Mistake is to assume that facts can be known. Planned economy is a clarifying example. No person or organization can predict the complex interactions between capital, resources, labor, intellectual property, and distribution. Planned economy is a mistake because it assumes that facts about the future can be known. A market economy isn&#39;t planned. It&#39;s not based on facts. Technological advancements, and changes in consusumer demands, are met by opportunistic companies. Each individual company has a plan of course. But the market itself doesn&#39;t. Clearly, in many situations, facts can be known. The sun will rise tomorrow and you&#39;re reading this paragraph right now. But be aware — looks can be decieving. Newton&#39;s law of gravity describes a simple relationship between moving bodies, but a system with more than just two bodies is impossible to analytically predict. What looks simple might not be so. There&#39;s no reason to expect that the universe should behave in an analytically predictable manner. You should expect the opposite. Assume that no plan survives contact with the enemy. Assume that facts can&#39;t be known. Don&#39;t make the Communist Mistake."
    },
    {
        "title": "The Control Paradox",
        "description": "",
        "url": "/posts/the-control-paradox.html",
        "content": "Oct 23, 2022 The Control Paradox If you wish to control something, you need to understand it. But in order to understand something, you must let go of your wish to control it."
    },
    {
        "title": "The Inverse Perception Equality",
        "description": "",
        "url": "/posts/the-inverse-perception-equality.html",
        "content": "Dec 1, 2021 The Inverse Perception Equality It looks like the sun is orbiting earth. Or does it? What would it have looked like if it was the other way around? What would it have looked like if earth was spinning around the sun? Does it look like that other train is moving — or does it look like it&#39;s your train that&#39;s moving? What exactly is your perception telling you? Your friend might seem closed-minded when dismissing a topic you want to discuss. But perhaps it&#39;s you that&#39;s dismissing your friend&#39;s dismissal. Telling others to &quot;wake up&quot; doesn&#39;t mean you&#39;re not sleeping. Ask yourself, if the inverse of your preception was true, what would it have looked like?"
    },
    {
        "title": "The Parenting Problem",
        "description": "",
        "url": "/posts/the-parenting-problem.html",
        "content": "Dec 13, 2020 The Parenting Problem The purpose of parenting is teaching children how to become successful. The problem is, success cannot be taught: By their own estimate, most parents aren&#39;t successful. Successful parents don&#39;t really understand what made them successful. Whatever made them successful is not relevant today. Whatever made them successful is not relevant to their children. Their children have a different definition of success. Their children don&#39;t want to be taught. The Parenting Problem is not limited to parenting. It applies to mentoring and teaching in general."
    },
    {
        "title": "When The Moment Comes",
        "description": "",
        "url": "/posts/when-the-moment-comes.html",
        "content": "Mar 31, 2023 When The Moment Comes This will be my monument. This will be a beacon when I&#39;m gone. So that when the moment comes, I can say I did it all with love. — Robyn, Monument"
    }
]