[
    {
        "title": "Anti-Intuition",
        "description": "",
        "url": "/drafts/anti-intuition.html",
        "content": "XX, 2023 Anti-Intuition If you work in a complex environment like business, product design, or finance, you shouldn&#39;t trust your intuition. Intuition is an efficient unconsious pattern reconition mechanism. Your intuition can be correct or wrong, but it feels the exact same way in both situations. You feel confident that you&#39;re correct. You can improve your intuition by not trusting it. Study complex and surprising fields to improve your anti-intuition. Study linguistics rather than grammar. Study ecosystems rather than genetics. When you study linguistics and ecosystems enough, you will learn that your assumptions and intuitions are frequently wrong. Try to improve this spontanous reaction. When you feel like you know something, you should immediately become suspicious. This is anti-intuition."
    },
    {
        "title": "Identity Instrumentalization",
        "description": "",
        "url": "/drafts/identity-instrumentalization.html",
        "content": "XX, 2023 Identity Instrumentalization Identity is valuable only as a goal. As something to aspire to become. Once achieved, and recognized by professional peers, identity becomes shackles. But once you&#39;ve reach a certain level, once you&#39;ve become what you want to become, your identity will confine you. You must shred your identity and transform it to an instrument. Once you&#39;ve become a leader, you must begin thinking of leadership as an instrument to serve others. You have to run to stand still."
    },
    {
        "title": "ekmwest",
        "description": "",
        "url": "/drafts/index.html",
        "content": "Drafts Anti-Intuition XX, 2023 Identity Instrumentalization XX, 2023 The Status Trap XX, 2023"
    },
    {
        "title": "The Status Trap",
        "description": "",
        "url": "/drafts/the-status-trap.html",
        "content": "XX, 2023 The Status Trap As you develop your expertise, you&#39;ll successfully think and operate on a higher level. This is natural, but there&#39;s a risk. If you move too fast, you can get lost."
    },
    {
        "title": "ekmwest",
        "description": "",
        "url": "/index.html",
        "content": "The Control Paradox OCT 23, 2022 The Inverse Perception Equality DEC 1, 2021 The Closed-Minded Symmetry SEP 10, 2021 The Communist Mistake APR 29, 2021 The Parenting Problem DEC 13, 2020"
    },
    {
        "title": "",
        "description": "",
        "url": "/posts/index.html",
        "content": ""
    },
    {
        "title": "The Closed-Minded Symmetry",
        "description": "",
        "url": "/posts/the-closed-minded-symmetry.html",
        "content": "September 10, 2021 The Closed-Minded Symmetry If A regards B as closed-minded, it&#39;s typically true that B regards A as closed-minded."
    },
    {
        "title": "The Communist Mistake",
        "description": "",
        "url": "/posts/the-communist-mistake.html",
        "content": "April 29, 2021 The Communist Mistake The Communist Mistake is to assume that facts can be known. Planned economy is a clarifying example. No person or organization can predict the complex interactions between capital, resources, labor, intellectual property, and distribution. Planned economy is a mistake because it assumes that facts about the future can be known. A market economy isn&#39;t planned. It&#39;s not based on facts. Technological advancements, and changes in consusumer demands, are met by opportunistic companies. Each individual company has a plan of course. But the market itself doesn&#39;t. Clearly, in many situations, facts can be known. The sun will rise tomorrow and you&#39;re reading this paragraph right now. But be aware — looks can be decieving. Newton&#39;s law of gravity describes a simple relationship between moving bodies, but a system with more than just two bodies is impossible to analytically predict. What looks simple might not be so. There&#39;s no reason to expect that the universe should behave in an analytically predictable manner. You should expect the opposite. Assume that no plan survives contact with the enemy. Assume that facts can&#39;t be known. Don&#39;t make the Communist Mistake."
    },
    {
        "title": "The Control Paradox",
        "description": "",
        "url": "/posts/the-control-paradox.html",
        "content": "October 23, 2022 The Control Paradox If you wish to control something, you need to understand it. But in order to understand something, you must let go of your wish to control it."
    },
    {
        "title": "The Inverse Perception Equality",
        "description": "",
        "url": "/posts/the-inverse-perception-equality.html",
        "content": "December 1, 2021 The Inverse Perception Equality It looks like the sun is orbiting earth. Or does it? What would it have looked like if it was the other way around? What would it have looked like if our planet was spinning around the sun? Does it look like that other train is moving — or does it look like it&#39;s your train that&#39;s moving? What exactly is your perception telling you? Your friend might seem closed-minded when dismissing a book you want to discuss. But what if the book is crap? Are you dismissing your friend&#39;s dismissal? Telling others to &quot;wake up&quot; doesn&#39;t mean you&#39;re not sleeping. Ask yourself, if the inverse of your preception was true, what would it have looked like?"
    },
    {
        "title": "The Parenting Problem",
        "description": "",
        "url": "/posts/the-parenting-problem.html",
        "content": "December 13, 2020 The Parenting Problem The purpose of parenting is teaching children how to become successful. The problem is, success cannot be taught: By their own estimate, most parents aren&#39;t successful. Successful parents don&#39;t really understand what made them successful. Whatever made them successful is not relevant today. Whatever made them successful is not relevant to their children. Their children have a different definition of success. Their children don&#39;t want to be taught. The Parenting Problem is not limited to parenting. It applies to mentoring and teaching in general."
    },
    {
        "title": "Thought Experiments",
        "description": "",
        "url": "/thought-experiments/index.html",
        "content": "Thought Experiments I take no credit for any of these thoughts. Most of them are probably stolen — unconsciously — from coworkers much brighter than me. Attribution suggestions are welcome. 23 dec 2022 Do you seek to create conformity or creativity? 22 dec 2022 Facts can conceal truth. 6 dec 2022 Originality is essential for branding, but harmful for usability. 3 nov 2022 Why do we like symmetry? What's the evolutionary explanation? 26 oct 2022 Understand that \"opinions\" are just theories clouded by identity politics. Including your opinions. 1 oct 2022 Don't figure it out. Figure out how to figure it out. 11 sep 2022 I don't understand what I see. I see what I understand. 26 aug 2022 Prototype to learn. 5 aug 2022 It's not about how much you know, it's about how fast you learn. Compete with kids instead of experts. 17 jul 2022 Everything is good in some contexts, and bad in others. 10 jun 2022 The first question must always be: What is the right question? 23 may 2022 There are two kind of designers: (1) those who truly care about users and (2) those who believe they truly care about users. One way to tell them apart: When a designer is certain she's of the first kind, she's typically not. 7 may 2022 Always gather more perspectives. 4 apr 2022 Kindness is partly a decision, but primarily a skill. This is profoundly counterintuitive and rarely understood. 9 mar 2022 Opinions are not based on facts. They're based on perspectives. 19 feb 2022 Try to understand reality. But more importantly, try to understand how your point of view shapes the way you understand reality. 30 jan 2022 Nothing is either good or bad. Everything good and bad. 4 jan 2022 Don't do what the prophet tell you to do. Instead, observe what the prophet does, and listen to what the prophet listens to. Don't be a consumer. 8 dec 2021 Good intuitions feels exactly the same as bad intuitions. 28 nov 2021 A mission driven enterprise must be opt-in. An influenced mind can never create at the highest level. 6 oct 2021 Focus on context and framing. Trust that solutions will emerge. 28 sep 2021 Try not to discover new things. Try to discover new ways to discover new things. 18 aug 2021 A system is complex (or not), in and of itself. But you can also judge a system from a epistemic perspective: If you know nothing about a system, it might appear complex to you (even though it isn't). You must understand the difference. 6 aug 2021 A solution is a piece that only can be found by exploring the puzzle. 4 jul 2021 Am I using pain as an excuse not to live? 12 jun 2021 Being uncertain and doubtful is a powerful skill. It's a skill that can be practiced. 8 may 2021 Don't report the answer you found. Show the the path to place where you found the question. 16 apr 2021 Confidence don't cause skill. Skill cause confidence. Surprisingly, this is rarely understood. 11 mar 2021 True love let go. 9 feb 2021 Pessimism undermines trust in established models, and creates markets for new opinions, theories, and cults. 2 jan 2021 When you compete, you're playing by someone else's rules. 20 dec 2020 Is the abstraction relevant? Is the label useful? How can you tell? 30 nov 2020 Do you want to create something valuable? Find people with different perespectives, and avoid people with different motives. Seek alignment at the fundamental level, and seek divergence at the higher levels. 25 oct 2020 When curiosity is key, expertise is a barrier. 14 sep 2020 Trial-and-error requires speed. If the process is slow, you need intelligence. 8 aug 2020 What do you discuss with your customers? Solutions or problems? 23 jul 2020 When you say \"we\", are you including or excluding? 26 jun 2020 It is easy to level up from junior to senior. You move from trial-and-error to knowledge and skills. It's tremendously difficult to level up from senior to master. You must to move back to trial-and-error. Vanity is a much bigger hurdle than ignorance. 2 may 2020 Good designers love design. Great designers love users. 17 apr 2020 The darker the night, the brighter the stars. 11 mar 2020 For the midwit, looking down at the edges, there's no perceptible difference between the master and the idiot. 9 feb 2020 You only respect what you pay for. 17 jan 2020 Letter styles were highly influenced by existing writing tools. Be aware of your medium. 19 dec 2019 Not a single fact has been expressed without a motive. 17 nov 2019 First-principles thinking doesn't work in complex environments. 16 oct 2019 Your value depends on you being right? Red flag. 4 sep 2019 Don't say sorry I'm late. Say thank you for waiting. 9 aug 2019 Don't say \"thank you\". Instead, learn to be greateful. 15 jul 2019 You can't wake a person who's pretending to sleep. 28 jun 2019 Creativity comes from friction, limitations, and troubles. What would you create if there were no needs and no problems? 22 may 2019 Telling others to wake up doesn't mean you're not sleeping. 4 mar 2019 Confidence is about keeping the promises you make to yourself. 24 jan 2019 If I don't know you, how could I give you advice? 19 jan 2019 I don't believe in time. In only believe in moments."
    }
]